## KPMG Potential New Customer Analysis

KPMG has asked us to profile some potential customers for a targeted advert. The aim is to conduct sales and marketing campaigne with the limited available resources in order to increase sales and revenue. The data set was provided by KPMG and contains only the new customer information. It is unclean and comprises of 1000 records and 23 features. It needs to go through some preporcessing steps, analyzed and interpreted.
This will be the new data our algorithm will generalize on

In [1]:
# importing the rquired libraries for he analysis
import numpy as np
import pandas as pd
import datetime

In [2]:
# loading the data into pandas dataframe
new_cust = pd.read_excel('C:/Users/Chuks/datasets/kpmg_new_customer.xlsx')

In [3]:
# displaying the data
new_cust.sample(5)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
973,Alex,Patshull,Female,37,1966-01-02,Senior Quality Engineer,Retail,Mass Customer,N,Yes,...,QLD,Australia,5,0.71,0.8875,0.88750,0.754375,974,974,0.425
718,Nalani,Hallad,Female,15,1999-11-30,Environmental Specialist,Health,Affluent Customer,N,Yes,...,VIC,Australia,9,0.62,0.7750,0.96875,0.968750,719,719,0.675
239,Harman,Lynds,Male,4,1961-05-27,Professor,NaN,Mass Customer,N,Yes,...,QLD,Australia,8,0.85,1.0625,1.06250,0.903125,240,240,1.090
720,Brendis,Pineaux,Male,12,1978-01-15,Mechanical Systems Engineer,Manufacturing,Mass Customer,N,No,...,NSW,Australia,4,0.48,0.4800,0.48000,0.408000,719,719,0.675
221,Kort,Disley,Male,66,1979-02-05,Technical Writer,Health,Mass Customer,N,Yes,...,NSW,Australia,9,0.76,0.9500,1.18750,1.009375,219,219,1.125

In [4]:
# displaying each column name, the number of rows, the count and the data type
new_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

At a glance there are a number of features without a name such as Unamed: 16 to Unnamed: 20. These will be dropped.

In [5]:
# displaying deceased_indicator and country unique values
print(new_cust['deceased_indicator'].unique())
print(new_cust['country'].unique())

['N']
['Australia']

Deceased_indicator and country columns contain only one variable and as such will not be useful for the analysis. 

First name, last name, job title, address, Value, postcode Rank and value columns will also not be useful for our analysis

In [6]:
#dropping some columns
new_cust = new_cust.drop(['first_name', 'last_name', 'job_title', 'Unnamed: 16', 'Unnamed: 17', 
                          'Unnamed: 18', 'Rank', 'Unnamed: 19', 'Unnamed: 20', 'country', 'address', 
                          'deceased_indicator', 'Value', 'postcode'], axis=1)

In [7]:
# displaying the first 5 rows
new_cust.head()

,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation
0,Male,86,1957-07-12,Manufacturing,Mass Customer,Yes,14,QLD,6
1,Male,69,1970-03-22,Property,Mass Customer,No,16,NSW,11
2,Female,10,1974-08-28,Financial Services,Affluent Customer,No,10,VIC,5
3,Female,64,1979-01-28,Manufacturing,Affluent Customer,Yes,5,QLD,1
4,Female,34,1965-09-21,Financial Services,Affluent Customer,No,19,NSW,9

In [8]:
# displaying the unique values in the gender column
new_cust['gender'].unique()

array(['Male', 'Female', 'U'], dtype=object)

In [9]:
# displaying only the rows with in the gender column with value "U"
new_cust[new_cust['gender'] == 'U']

,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation
59,U,5,NaT,IT,Mass Customer,No,4,VIC,5
226,U,35,NaT,IT,Affluent Customer,Yes,11,NSW,9
324,U,69,NaT,IT,Mass Customer,Yes,3,VIC,3
358,U,65,NaT,Entertainment,Affluent Customer,No,5,QLD,8
360,U,71,NaT,IT,Mass Customer,Yes,11,VIC,7
374,U,66,NaT,IT,Mass Customer,No,15,QLD,6
434,U,52,NaT,IT,Mass Customer,No,7,VIC,5
439,U,93,NaT,IT,Mass Customer,Yes,14,VIC,6
574,U,69,NaT,IT,Mass Customer,No,12,NSW,7
598,U,15,NaT,IT,Affluent Customer,No,5,NSW,11
664,U,43,NaT,IT,High Net Worth,Yes,0,VIC,4
751,U,20,NaT,IT,High Net Worth,Yes,14,VIC,7
775,U,62,NaT,Financial Services,Affluent Customer,No,5,VIC,1
835,U,88,NaT,IT,Mass Customer,No,13,NSW,11
883,U,24,NaT,IT,Affluent Customer,No,2,NSW,10
904,U,0,NaT,IT,Mass Customer,No,2,NSW,6
984,U,82,NaT,IT,Affluent Customer,Yes,0,NSW,10

In [10]:
# dropping only the rows with in the gender column with value "U"
new_cust.drop(new_cust.loc[new_cust['gender'] == 'U'].index, inplace=True)

In [11]:
# displaying the unique values of the gender
new_cust['gender'].unique()

array(['Male', 'Female'], dtype=object)

In [12]:
# renaming column
new_cust.rename(columns={'past_3_years_bike_related_purchases':'3yrs_purchases'}, 
                inplace=True)

In [13]:
# displaying the unique of 3yrs_purchases column
new_cust['3yrs_purchases'].unique()

array([86, 69, 10, 64, 34, 39, 23, 74, 50, 72, 94, 48, 60, 38, 32, 88, 61,
       83, 65,  2, 11, 44, 26,  5, 78, 19, 71, 84, 45, 62, 70, 27, 76, 58,
       73, 24, 79, 52, 29, 14, 85, 59, 12, 55, 97, 87, 75, 51, 47, 31, 22,
       54, 82, 98,  0, 36, 15, 53,  9,  8, 49, 93, 25, 91, 18, 30, 56, 21,
       95,  1, 37, 57,  3, 66, 13, 42, 89, 90, 28, 92,  6,  4, 40, 16, 96,
       99, 33, 68, 67,  7, 46, 41, 17, 81, 35, 63, 20, 80, 43, 77],
      dtype=int64)

In [14]:
# displaying the unique dates
new_cust['DOB'].unique()

array(['1957-07-12T00:00:00.000000000', '1970-03-22T00:00:00.000000000',
       '1974-08-28T00:00:00.000000000', '1979-01-28T00:00:00.000000000',
       '1965-09-21T00:00:00.000000000', '1951-04-29T00:00:00.000000000',
       '1976-10-06T00:00:00.000000000', '1972-12-27T00:00:00.000000000',
       '1972-04-28T00:00:00.000000000', '1985-08-02T00:00:00.000000000',
       '1995-01-01T00:00:00.000000000', '1999-08-30T00:00:00.000000000',
       '1990-05-13T00:00:00.000000000', '1976-12-09T00:00:00.000000000',
       '1964-04-19T00:00:00.000000000', '1954-03-31T00:00:00.000000000',
       '1993-08-22T00:00:00.000000000', '1976-06-08T00:00:00.000000000',
       '1938-11-09T00:00:00.000000000', '1954-08-12T00:00:00.000000000',
       '1968-12-21T00:00:00.000000000', '1993-09-29T00:00:00.000000000',
       '1998-02-05T00:00:00.000000000', '1977-12-17T00:00:00.000000000',
       '1982-10-11T00:00:00.000000000', '1945-08-03T00:00:00.000000000',
       '1952-06-27T00:00:00.000000000', '1966-07-20T00:00:00.000000000',
       '1960-12-10T00:00:00.000000000', '1960-11-22T00:00:00.000000000',
       '1980-01-26T00:00:00.000000000', '1951-11-28T00:00:00.000000000',
       '1987-01-15T00:00:00.000000000', '1981-09-22T00:00:00.000000000',
       '1977-05-09T00:00:00.000000000', '1975-05-10T00:00:00.000000000',
       '1968-03-25T00:00:00.000000000', '1979-04-11T00:00:00.000000000',
       '1955-06-13T00:00:00.000000000', '1993-08-28T00:00:00.000000000',
       '1953-02-13T00:00:00.000000000', '1985-03-14T00:00:00.000000000',
       '1946-10-25T00:00:00.000000000', '1966-09-18T00:00:00.000000000',
       '1961-12-05T00:00:00.000000000', '1956-08-30T00:00:00.000000000',
       '1956-07-16T00:00:00.000000000', '1994-12-04T00:00:00.000000000',
       '1977-05-14T00:00:00.000000000', '1950-05-03T00:00:00.000000000',
       '1978-02-11T00:00:00.000000000', '1999-03-22T00:00:00.000000000',
       '1993-12-19T00:00:00.000000000', '1981-12-01T00:00:00.000000000',
       '1995-03-25T00:00:00.000000000', '1981-02-03T00:00:00.000000000',
       '1979-12-17T00:00:00.000000000', '1972-10-31T00:00:00.000000000',
       '1966-07-29T00:00:00.000000000', '1983-02-11T00:00:00.000000000',
       '1971-12-29T00:00:00.000000000', '1942-02-06T00:00:00.000000000',
       '1967-03-18T00:00:00.000000000', '1999-11-21T00:00:00.000000000',
       '1983-02-01T00:00:00.000000000', '1996-07-20T00:00:00.000000000',
       '1984-10-07T00:00:00.000000000', '1999-06-08T00:00:00.000000000',
       '1988-09-18T00:00:00.000000000', '1996-08-03T00:00:00.000000000',
       '1994-08-04T00:00:00.000000000', '1999-09-21T00:00:00.000000000',
       '1968-02-16T00:00:00.000000000', '1958-04-21T00:00:00.000000000',
       '1974-09-17T00:00:00.000000000', '1961-04-15T00:00:00.000000000',
       '1956-10-22T00:00:00.000000000', '1972-01-14T00:00:00.000000000',
       '1973-11-28T00:00:00.000000000', '1995-04-09T00:00:00.000000000',
       '1965-09-08T00:00:00.000000000', '1981-02-22T00:00:00.000000000',
       '1975-09-12T00:00:00.000000000', '1961-03-22T00:00:00.000000000',
       '1949-04-29T00:00:00.000000000', '1999-02-15T00:00:00.000000000',
       '1942-11-01T00:00:00.000000000', '1950-02-10T00:00:00.000000000',
       '1971-08-18T00:00:00.000000000', '1992-04-19T00:00:00.000000000',
       '1978-02-19T00:00:00.000000000', '1977-09-01T00:00:00.000000000',
       '1952-09-21T00:00:00.000000000', '1978-12-14T00:00:00.000000000',
       '1999-10-20T00:00:00.000000000', '1943-02-08T00:00:00.000000000',
       '1994-10-31T00:00:00.000000000', '1972-11-02T00:00:00.000000000',
       '2000-05-09T00:00:00.000000000', '1991-01-22T00:00:00.000000000',
       '1994-02-11T00:00:00.000000000', '1940-01-18T00:00:00.000000000',
       '1980-10-20T00:00:00.000000000', '1961-10-20T00:00:00.000000000',
       '1946-10-23T00:00:00.000000000', '1963-06-16T00:00:00.000000000',
       '1972-04-23T00:00:00.000000000', '1961-10-22T00:00:00.000000000',
       '1969-11-09T00:00:00.000000000', '1968-11-15T00:00:00.000000000',
       '1939-12-09T00:00:00.000000000', '1961-11-05T00:00:00.000000000',
       '1995-08-13T00:00:00.000000000', '1977-11-08T00:00:00.000000000',
       '1997-11-13T00:00:00.000000000', '1946-07-09T00:00:00.000000000',
       '1978-01-11T00:00:00.000000000', '1987-10-08T00:00:00.000000000',
       '1952-12-14T00:00:00.000000000', '1981-10-29T00:00:00.000000000',
       '1997-05-28T00:00:00.000000000', '1969-07-20T00:00:00.000000000',
       '1975-03-13T00:00:00.000000000', '1941-02-22T00:00:00.000000000',
       '1956-02-08T00:00:00.000000000', '1953-02-27T00:00:00.000000000',
       '1975-03-10T00:00:00.000000000', '1940-02-02T00:00:00.000000000',
       '1990-07-12T00:00:00.000000000', '1962-07-28T00:00:00.000000000',
       '1965-07-03T00:00:00.000000000', '1960-03-18T00:00:00.000000000',
       '1985-07-23T00:00:00.000000000', '1978-02-05T00:00:00.000000000',
       '1970-11-08T00:00:00.000000000', '1990-05-29T00:00:00.000000000',
       '1967-09-27T00:00:00.000000000', '1979-06-18T00:00:00.000000000',
       '1980-02-11T00:00:00.000000000', '1966-07-16T00:00:00.000000000',
       '2001-03-08T00:00:00.000000000', '1949-03-06T00:00:00.000000000',
       '1975-12-27T00:00:00.000000000', '1981-08-08T00:00:00.000000000',
       '1950-11-05T00:00:00.000000000', '1965-07-15T00:00:00.000000000',
       '1969-10-02T00:00:00.000000000', '1969-05-21T00:00:00.000000000',
       '1971-03-31T00:00:00.000000000', '1967-12-18T00:00:00.000000000',
       '1961-12-26T00:00:00.000000000', '1969-02-10T00:00:00.000000000',
       '1961-08-14T00:00:00.000000000', '1956-09-04T00:00:00.000000000',
       '1963-04-24T00:00:00.000000000', '1976-10-24T00:00:00.000000000',
       '1957-05-25T00:00:00.000000000', '1978-01-15T00:00:00.000000000',
       '1951-06-11T00:00:00.000000000', '1986-08-07T00:00:00.000000000',
       '1995-08-04T00:00:00.000000000', '1969-08-27T00:00:00.000000000',
       '1951-07-10T00:00:00.000000000', '1979-05-22T00:00:00.000000000',
       '1976-03-12T00:00:00.000000000', '1973-03-18T00:00:00.000000000',
       '1989-01-05T00:00:00.000000000', '1952-07-01T00:00:00.000000000',
       '1986-01-23T00:00:00.000000000', '1955-06-05T00:00:00.000000000',
       '1956-02-22T00:00:00.000000000', '1989-11-18T00:00:00.000000000',
       '1995-02-19T00:00:00.000000000', '1955-09-06T00:00:00.000000000',
       '1992-07-05T00:00:00.000000000', '1939-01-29T00:00:00.000000000',
       '1952-04-01T00:00:00.000000000', '1950-12-26T00:00:00.000000000',
       '1975-03-26T00:00:00.000000000', '1965-01-08T00:00:00.000000000',
       '1974-12-09T00:00:00.000000000', '1946-03-24T00:00:00.000000000',
       '1974-03-25T00:00:00.000000000', '1985-09-02T00:00:00.000000000',
       '1992-07-27T00:00:00.000000000', '1971-11-28T00:00:00.000000000',
       '1973-05-09T00:00:00.000000000', '1986-11-09T00:00:00.000000000',
       '1996-05-30T00:00:00.000000000', '1992-03-27T00:00:00.000000000',
       '1938-10-16T00:00:00.000000000', '1970-03-19T00:00:00.000000000',
       '1969-08-02T00:00:00.000000000', '1944-01-05T00:00:00.000000000',
       '1972-03-10T00:00:00.000000000', '1981-02-16T00:00:00.000000000',
       '1990-01-09T00:00:00.000000000', '1993-11-18T00:00:00.000000000',
       '1966-01-02T00:00:00.000000000', '1940-12-05T00:00:00.000000000',
       '1959-04-19T00:00:00.000000000', '1945-02-13T00:00:00.000000000',
       '1952-10-20T00:00:00.000000000', '1998-11-26T00:00:00.000000000',
       '1948-10-12T00:00:00.000000000', '1976-08-27T00:00:00.000000000',
       '1955-08-18T00:00:00.000000000', '1958-01-03T00:00:00.000000000',
       '1967-05-25T00:00:00.000000000', '1967-12-12T00:00:00.000000000',
       '1983-11-26T00:00:00.000000000', '1997-03-13T00:00:00.000000000',
       '1956-10-16T00:00:00.000000000', '1947-02-28T00:00:00.000000000',
       '2000-04-07T00:00:00.000000000', '1997-09-04T00:00:00.000000000',
       '1963-01-01T00:00:00.000000000', '1980-02-16T00:00:00.000000000',
       '1994-04-15T00:00:00.000000000', '1981-06-20T00:00:00.000000000',
       '1979-02-05T00:00:00.000000000', '1966-01-08T00:00:00.000000000',
       '2000-01-25T00:00:00.000000000', '1977-12-06T00:00:00.000000000',
       '2000-06-25T00:00:00.000000000', '1964-06-22T00:00:00.000000000',
       '1954-11-13T00:00:00.000000000', '1963-12-13T00:00:00.000000000',
       '1978-05-31T00:00:00.000000000', '1943-09-24T00:00:00.000000000',
       '1965-08-15T00:00:00.000000000', '1943-07-14T00:00:00.000000000',
       '1997-07-23T00:00:00.000000000', '1940-07-13T00:00:00.000000000',
       '1943-10-05T00:00:00.000000000', '1939-04-04T00:00:00.000000000',
       '1941-10-02T00:00:00.000000000', '1961-05-27T00:00:00.000000000',
       '1974-01-24T00:00:00.000000000', '1959-05-08T00:00:00.000000000',
       '1969-09-21T00:00:00.000000000', '1957-11-15T00:00:00.000000000',
       '1950-09-05T00:00:00.000000000', '1967-09-11T00:00:00.000000000',
       '1963-05-02T00:00:00.000000000', '1971-04-26T00:00:00.000000000',
       '1978-12-11T00:00:00.000000000', '1974-05-14T00:00:00.000000000',
       '1975-03-12T00:00:00.000000000', '1967-02-03T00:00:00.000000000',
       '1961-01-16T00:00:00.000000000', '1980-09-16T00:00:00.000000000',
       '1997-09-25T00:00:00.000000000', '1939-07-17T00:00:00.000000000',
       '1959-04-11T00:00:00.000000000', '1962-03-03T00:00:00.000000000',
       '2000-09-25T00:00:00.000000000', '1971-11-27T00:00:00.000000000',
       '1969-07-06T00:00:00.000000000', '1991-06-07T00:00:00.000000000',
       '1992-11-18T00:00:00.000000000', '1948-01-13T00:00:00.000000000',
       '1996-02-19T00:00:00.000000000', '1938-08-31T00:00:00.000000000',
       '1969-11-17T00:00:00.000000000', '1973-09-25T00:00:00.000000000',
       '1951-12-16T00:00:00.000000000', '1972-01-17T00:00:00.000000000',
       '1996-07-01T00:00:00.000000000', '1961-01-03T00:00:00.000000000',
       '1976-08-24T00:00:00.000000000', '1956-06-28T00:00:00.000000000',
       '1976-06-11T00:00:00.000000000', '1966-03-07T00:00:00.000000000',
       '1953-03-12T00:00:00.000000000', '1962-10-06T00:00:00.000000000',
       '1976-03-07T00:00:00.000000000', '1968-10-14T00:00:00.000000000',
       '1971-09-18T00:00:00.000000000', '1978-04-02T00:00:00.000000000',
       '1959-01-05T00:00:00.000000000', '1967-01-09T00:00:00.000000000',
       '1957-03-23T00:00:00.000000000', '1947-04-22T00:00:00.000000000',
       '1958-12-28T00:00:00.000000000', '1976-04-20T00:00:00.000000000',
       '1990-11-13T00:00:00.000000000', '1981-06-03T00:00:00.000000000',
       '1972-07-30T00:00:00.000000000', '1958-12-07T00:00:00.000000000',
       '1963-05-11T00:00:00.000000000', '1980-02-01T00:00:00.000000000',
       '1988-01-30T00:00:00.000000000', '1970-08-08T00:00:00.000000000',
       '1965-02-27T00:00:00.000000000', '1991-02-14T00:00:00.000000000',
       '1947-10-08T00:00:00.000000000', '1988-01-10T00:00:00.000000000',
       '1993-08-09T00:00:00.000000000', '1981-08-05T00:00:00.000000000',
       '1949-05-20T00:00:00.000000000', '1955-07-17T00:00:00.000000000',
       '1974-08-09T00:00:00.000000000', '1954-11-09T00:00:00.000000000',
       '1959-06-12T00:00:00.000000000', '1981-02-15T00:00:00.000000000',
       '1971-08-19T00:00:00.000000000', '1991-02-07T00:00:00.000000000',
       '1965-12-13T00:00:00.000000000', '1989-12-15T00:00:00.000000000',
       '1968-11-24T00:00:00.000000000', '1992-01-31T00:00:00.000000000',
       '1978-05-13T00:00:00.000000000', '1957-10-17T00:00:00.000000000',
       '1985-03-26T00:00:00.000000000', '1955-07-28T00:00:00.000000000',
       '1981-09-11T00:00:00.000000000', '1976-11-06T00:00:00.000000000',
       '1977-04-08T00:00:00.000000000', '1981-11-29T00:00:00.000000000',
       '1992-08-27T00:00:00.000000000', '1955-01-08T00:00:00.000000000',
       '1952-05-19T00:00:00.000000000', '1982-02-10T00:00:00.000000000',
       '1978-07-22T00:00:00.000000000', '1972-11-26T00:00:00.000000000',
       '1999-06-23T00:00:00.000000000', '1959-12-25T00:00:00.000000000',
       '1997-09-27T00:00:00.000000000', '1978-05-27T00:00:00.000000000',
       '1945-08-08T00:00:00.000000000', '1943-08-27T00:00:00.000000000',
       '1999-10-24T00:00:00.000000000', '1976-01-24T00:00:00.000000000',
       '1956-06-19T00:00:00.000000000', '1975-03-28T00:00:00.000000000',
       '1969-10-09T00:00:00.000000000', '1968-12-11T00:00:00.000000000',
       '1951-11-27T00:00:00.000000000', '1939-12-22T00:00:00.000000000',
       '1964-09-28T00:00:00.000000000', '1952-04-15T00:00:00.000000000',
       '1941-07-21T00:00:00.000000000', '1961-02-11T00:00:00.000000000',
       '1953-08-08T00:00:00.000000000', '1981-05-26T00:00:00.000000000',
       '1956-12-02T00:00:00.000000000', '1964-10-01T00:00:00.000000000',
       '1944-10-21T00:00:00.000000000', '1953-10-19T00:00:00.000000000',
       '2002-02-27T00:00:00.000000000', '1980-07-30T00:00:00.000000000',
       '1944-11-10T00:00:00.000000000', '1971-01-11T00:00:00.000000000',
       '1990-07-28T00:00:00.000000000', '1979-10-31T00:00:00.000000000',
       '1997-12-26T00:00:00.000000000', '1957-09-03T00:00:00.000000000',
       '1999-11-08T00:00:00.000000000', '1981-08-17T00:00:00.000000000',
       '1971-12-24T00:00:00.000000000', '1959-06-13T00:00:00.000000000',
       '1957-10-01T00:00:00.000000000', '1994-10-21T00:00:00.000000000',
       '1978-08-02T00:00:00.000000000', '1963-08-20T00:00:00.000000000',
       '1974-07-05T00:00:00.000000000', '1975-08-04T00:00:00.000000000',
       '1960-09-12T00:00:00.000000000', '1974-11-09T00:00:00.000000000',
       '1986-12-03T00:00:00.000000000', '1974-06-24T00:00:00.000000000',
       '1942-01-23T00:00:00.000000000', '1963-01-14T00:00:00.000000000',
       '1996-01-24T00:00:00.000000000', '1964-01-31T00:00:00.000000000',
       '1944-10-05T00:00:00.000000000', '1995-05-18T00:00:00.000000000',
       '1954-06-14T00:00:00.000000000', '1961-09-29T00:00:00.000000000',
       '1973-08-25T00:00:00.000000000', '1993-03-02T00:00:00.000000000',
       '1948-06-30T00:00:00.000000000', '1979-02-26T00:00:00.000000000',
       '1939-08-28T00:00:00.000000000', '1982-12-10T00:00:00.000000000',
       '1950-04-26T00:00:00.000000000', '1990-05-20T00:00:00.000000000',
       '1961-12-22T00:00:00.000000000', '2002-01-17T00:00:00.000000000',
       '1961-01-05T00:00:00.000000000', '1942-08-09T00:00:00.000000000',
       '1979-03-24T00:00:00.000000000', '1976-11-04T00:00:00.000000000',
       '1967-01-20T00:00:00.000000000', '1955-02-13T00:00:00.000000000',
       '1978-01-21T00:00:00.000000000', '1977-09-10T00:00:00.000000000',
       '1980-08-15T00:00:00.000000000', '1938-11-29T00:00:00.000000000',
       '1996-02-29T00:00:00.000000000', '1983-03-08T00:00:00.000000000',
       '1957-12-05T00:00:00.000000000', '1946-03-15T00:00:00.000000000',
       '1995-12-09T00:00:00.000000000', '1954-07-18T00:00:00.000000000',
       '1958-08-28T00:00:00.000000000', '1938-09-10T00:00:00.000000000',
       '1963-10-15T00:00:00.000000000', '1953-05-17T00:00:00.000000000',
       '1989-01-14T00:00:00.000000000', '1998-01-12T00:00:00.000000000',
       '1991-12-18T00:00:00.000000000', '1948-01-24T00:00:00.000000000',
       '1970-01-21T00:00:00.000000000', '1991-12-01T00:00:00.000000000',
       '1993-10-18T00:00:00.000000000', '1945-11-08T00:00:00.000000000',
       '1947-07-19T00:00:00.000000000', '1975-01-08T00:00:00.000000000',
       '1969-02-09T00:00:00.000000000', '1977-09-26T00:00:00.000000000',
       '1940-11-10T00:00:00.000000000', '1974-12-12T00:00:00.000000000',
       '1975-12-22T00:00:00.000000000', '1957-11-12T00:00:00.000000000',
       '1978-10-26T00:00:00.000000000', '1973-11-14T00:00:00.000000000',
       '1997-08-27T00:00:00.000000000', '1974-08-07T00:00:00.000000000',
       '1952-10-05T00:00:00.000000000', '1941-04-04T00:00:00.000000000',
       '1997-03-17T00:00:00.000000000', '1987-03-01T00:00:00.000000000',
       '1964-01-22T00:00:00.000000000', '1972-05-17T00:00:00.000000000',
       '1993-11-27T00:00:00.000000000', '1958-04-19T00:00:00.000000000',
       '1966-04-30T00:00:00.000000000', '1977-02-03T00:00:00.000000000',
       '1998-11-22T00:00:00.000000000', '1996-11-24T00:00:00.000000000',
       '1991-12-02T00:00:00.000000000', '1943-04-06T00:00:00.000000000',
       '1982-02-01T00:00:00.000000000', '1985-01-29T00:00:00.000000000',
       '1961-07-31T00:00:00.000000000', '1976-09-07T00:00:00.000000000',
       '1972-08-27T00:00:00.000000000', '1947-03-11T00:00:00.000000000',
       '1974-11-25T00:00:00.000000000', '1940-05-19T00:00:00.000000000',
       '1947-11-26T00:00:00.000000000', '1965-02-03T00:00:00.000000000',
       '1977-03-20T00:00:00.000000000', '1993-08-03T00:00:00.000000000',
       '1972-05-19T00:00:00.000000000', '1970-12-17T00:00:00.000000000',
       '2000-12-09T00:00:00.000000000', '2001-08-04T00:00:00.000000000',
       '1990-10-19T00:00:00.000000000', '1967-03-14T00:00:00.000000000',
       '1999-11-29T00:00:00.000000000', '1956-04-21T00:00:00.000000000',
       '1979-07-28T00:00:00.000000000', '2001-12-29T00:00:00.000000000',
       '1972-07-29T00:00:00.000000000', '1995-10-03T00:00:00.000000000',
       '1957-02-14T00:00:00.000000000', '1951-04-30T00:00:00.000000000',
       '1959-03-01T00:00:00.000000000', '1939-03-06T00:00:00.000000000',
       '1961-08-27T00:00:00.000000000', '1970-01-14T00:00:00.000000000',
       '1944-10-25T00:00:00.000000000', '1966-06-27T00:00:00.000000000',
       '1966-09-14T00:00:00.000000000', '1994-03-13T00:00:00.000000000',
       '1975-06-15T00:00:00.000000000', '1975-10-12T00:00:00.000000000',
       '1965-05-28T00:00:00.000000000', '1996-02-11T00:00:00.000000000',
       '1944-06-14T00:00:00.000000000', '1997-11-01T00:00:00.000000000',
       '1952-05-05T00:00:00.000000000', '1960-05-09T00:00:00.000000000',
       '1989-03-17T00:00:00.000000000', '1954-10-21T00:00:00.000000000',
       '1967-02-02T00:00:00.000000000', '1976-09-20T00:00:00.000000000',
       '1974-08-19T00:00:00.000000000', '1960-12-19T00:00:00.000000000',
       '1975-09-11T00:00:00.000000000', '1945-07-10T00:00:00.000000000',
       '1980-09-01T00:00:00.000000000', '1974-08-29T00:00:00.000000000',
       '1976-11-24T00:00:00.000000000', '1980-03-14T00:00:00.000000000',
       '1973-10-13T00:00:00.000000000', '1999-05-14T00:00:00.000000000',
       '1976-03-10T00:00:00.000000000', '1954-01-30T00:00:00.000000000',
       '1988-09-30T00:00:00.000000000', '1971-06-28T00:00:00.000000000',
       '2001-06-21T00:00:00.000000000', '1964-05-15T00:00:00.000000000',
       '1999-07-28T00:00:00.000000000', '1954-10-06T00:00:00.000000000',
       '1951-10-14T00:00:00.000000000', '1956-05-17T00:00:00.000000000',
       '1991-01-23T00:00:00.000000000', '1950-09-30T00:00:00.000000000',
       '1980-05-29T00:00:00.000000000', '1954-03-10T00:00:00.000000000',
       '1964-11-06T00:00:00.000000000', '1953-05-24T00:00:00.000000000',
       '1972-06-27T00:00:00.000000000', '1973-07-03T00:00:00.000000000',
       '1998-12-19T00:00:00.000000000', '1981-09-14T00:00:00.000000000',
       '1986-01-10T00:00:00.000000000', '1955-04-08T00:00:00.000000000',
       '1952-12-04T00:00:00.000000000', '1956-05-29T00:00:00.000000000',
       '1978-12-10T00:00:00.000000000', '1994-11-16T00:00:00.000000000',
       '1997-11-29T00:00:00.000000000', '1965-04-22T00:00:00.000000000',
       '1976-09-25T00:00:00.000000000', '1975-04-08T00:00:00.000000000',
       '1950-11-30T00:00:00.000000000', '1998-02-19T00:00:00.000000000',
       '1977-06-30T00:00:00.000000000', '1972-04-27T00:00:00.000000000',
       '1973-01-06T00:00:00.000000000', '1984-07-06T00:00:00.000000000',
       '1991-04-21T00:00:00.000000000', '1979-01-03T00:00:00.000000000',
       '1976-01-16T00:00:00.000000000', '1999-04-21T00:00:00.000000000',
       '1958-05-14T00:00:00.000000000', '1995-10-01T00:00:00.000000000',
       '1993-11-02T00:00:00.000000000', '1972-03-24T00:00:00.000000000',
       '1994-02-04T00:00:00.000000000', '1947-04-21T00:00:00.000000000',

In [15]:
#min and max date in the dataset
print(min(new_cust['DOB']), max(new_cust['DOB']), sep='\n')

1938-06-08 00:00:00
2002-02-27 00:00:00

In [16]:
# converting the date of birth to age 
now = pd.Timestamp('now')
new_cust['age'] = (now.year - new_cust['DOB'].dt.year) - ((now.month - new_cust['DOB'].dt.month) < 0)

In [17]:
new_cust.head()

,gender,3yrs_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation,age
0,Male,86,1957-07-12,Manufacturing,Mass Customer,Yes,14,QLD,6,63
1,Male,69,1970-03-22,Property,Mass Customer,No,16,NSW,11,50
2,Female,10,1974-08-28,Financial Services,Affluent Customer,No,10,VIC,5,46
3,Female,64,1979-01-28,Manufacturing,Affluent Customer,Yes,5,QLD,1,42
4,Female,34,1965-09-21,Financial Services,Affluent Customer,No,19,NSW,9,55

In [18]:
#min and max date in the dataset
print(min(new_cust['age']), max(new_cust['age']), sep='\n')

18
82

In [19]:
# dropping DOB column
new_cust.drop(['DOB'], axis=1, inplace=True)

In [20]:
new_cust.head()

,gender,3yrs_purchases,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation,age
0,Male,86,Manufacturing,Mass Customer,Yes,14,QLD,6,63
1,Male,69,Property,Mass Customer,No,16,NSW,11,50
2,Female,10,Financial Services,Affluent Customer,No,10,VIC,5,46
3,Female,64,Manufacturing,Affluent Customer,Yes,5,QLD,1,42
4,Female,34,Financial Services,Affluent Customer,No,19,NSW,9,55

In [21]:
# unique job_industry_category values
new_cust['job_industry_category'].unique()

array(['Manufacturing', 'Property', 'Financial Services', 'Entertainment',
       'Retail', 'IT', 'Telecommunications', 'Health', nan, 'Argiculture'],
      dtype=object)

In [22]:
# dropping rows with NAN in job_industry_category by selecting only columns without NAN
new_cust = new_cust[new_cust['job_industry_category'].notna()]

In [23]:
# unique job_wealth_segment values
new_cust['wealth_segment'].unique()

array(['Mass Customer', 'Affluent Customer', 'High Net Worth'],
      dtype=object)

In [24]:
# unique owns_car values
new_cust['owns_car'].unique()

array(['Yes', 'No'], dtype=object)

In [25]:
# unique tenure values
new_cust['tenure'].unique()

array([14, 16, 10,  5, 19, 22,  8, 17,  3,  9,  4, 11, 12, 13,  7, 20, 15,
        6, 18, 21,  2,  1], dtype=int64)

In [26]:
# unique state values
new_cust['state'].unique()

array(['QLD', 'NSW', 'VIC'], dtype=object)

In [27]:
# unique property_valuation values
new_cust['property_valuation'].unique()

array([ 6, 11,  5,  1,  9,  7, 10,  8,  4,  2, 12,  3], dtype=int64)

In [28]:
# unique age values
new_cust['age'].unique()

array([63, 50, 46, 42, 55, 69, 44, 48, 35, 26, 21, 30, 56, 66, 27, 82, 52,
       38, 75, 68, 54, 60, 41, 34, 43, 45, 65, 67, 74, 64, 70, 39, 25, 37,
       49, 78, 53, 24, 36, 62, 59, 47, 77, 20, 81, 40, 57, 51, 23, 33, 80,
       58, 19, 71, 32, 31, 28, 61, 73, 79, 29, 76, 22, 72], dtype=int64)

In [29]:
# categorizing the age column and putting it in a seperate column 
cut_points = [17,35,60,90]
label_names = ["young adult","adult","senior"]
new_cust["age_categories"] = pd.cut(new_cust["age"],cut_points,labels=label_names)

In [30]:
# checking for null values
new_cust.isnull().sum()

gender                   0
3yrs_purchases           0
job_industry_category    0
wealth_segment           0
owns_car                 0
tenure                   0
state                    0
property_valuation       0
age                      0
age_categories           0
dtype: int64

In [31]:
new_cust

,gender,3yrs_purchases,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation,age,age_categories
0,Male,86,Manufacturing,Mass Customer,Yes,14,QLD,6,63,senior
1,Male,69,Property,Mass Customer,No,16,NSW,11,50,adult
2,Female,10,Financial Services,Affluent Customer,No,10,VIC,5,46,adult
3,Female,64,Manufacturing,Affluent Customer,Yes,5,QLD,1,42,adult
4,Female,34,Financial Services,Affluent Customer,No,19,NSW,9,55,adult
...,...,...,...,...,...,...,...,...,...,...
995,Male,60,Financial Services,Affluent Customer,No,9,NSW,7,61,senior
996,Male,22,Health,Mass Customer,No,6,NSW,10,19,young adult
997,Female,17,Financial Services,Affluent Customer,Yes,15,QLD,2,66,senior
998,Male,30,Financial Services,Mass Customer,Yes,19,QLD,2,68,senior
999,Male,56,Property,Mass Customer,Yes,14,NSW,9,65,senior

In [32]:
new_cust.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 818 non-null    object
 1   3yrs_purchases         818 non-null    int64
 2   job_industry_category  818 non-null    object
 3   wealth_segment         818 non-null    object
 4   owns_car               818 non-null    object
 5   tenure                 818 non-null    int64
 6   state                  818 non-null    object
 7   property_valuation     818 non-null    int64
 8   age                    818 non-null    int64
 9   age_categories         818 non-null    category
dtypes: category(1), int64(4), object(5)
memory usage: 64.8+ KB

In [33]:
# converting age_categories column from category to string
new_cust['age_categories'] = new_cust['age_categories'].astype(str)

In [34]:
new_cust.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 0 to 999
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   gender                 818 non-null    object
 1   3yrs_purchases         818 non-null    int64
 2   job_industry_category  818 non-null    object
 3   wealth_segment         818 non-null    object
 4   owns_car               818 non-null    object
 5   tenure                 818 non-null    int64
 6   state                  818 non-null    object
 7   property_valuation     818 non-null    int64
 8   age                    818 non-null    int64
 9   age_categories         818 non-null    object
dtypes: int64(4), object(6)
memory usage: 70.3+ KB

In [35]:
# dropping age column
new_cust.drop(['age'], axis=1, inplace=True)

In [36]:
new_cust

,gender,3yrs_purchases,job_industry_category,wealth_segment,owns_car,tenure,state,property_valuation,age_categories
0,Male,86,Manufacturing,Mass Customer,Yes,14,QLD,6,senior
1,Male,69,Property,Mass Customer,No,16,NSW,11,adult
2,Female,10,Financial Services,Affluent Customer,No,10,VIC,5,adult
3,Female,64,Manufacturing,Affluent Customer,Yes,5,QLD,1,adult
4,Female,34,Financial Services,Affluent Customer,No,19,NSW,9,adult
...,...,...,...,...,...,...,...,...,...
995,Male,60,Financial Services,Affluent Customer,No,9,NSW,7,senior
996,Male,22,Health,Mass Customer,No,6,NSW,10,young adult
997,Female,17,Financial Services,Affluent Customer,Yes,15,QLD,2,senior
998,Male,30,Financial Services,Mass Customer,Yes,19,QLD,2,senior
999,Male,56,Property,Mass Customer,Yes,14,NSW,9,senior

In [ ]:
# saving the cleaning data to disk 
new_cust.to_excel('new_cust1.xlsx')